[
  {
    "slug": "uaw-strike-lessons",
    "title": "What the UAW Strike Taught Us About the Future of Labor",
    "excerpt": "The United Auto Workers' historic victory against the Big Three automakers represents more than a contract win — it signals a potential recomposition of American labor power after four decades of retreat.",
    "content": "<p class=\"lead\">When Shawn Fain, president of the United Auto Workers, went on Facebook Live to announce simultaneous strikes at Ford, General Motors, and Stellantis, he did something American labor leaders had not done in a generation: he put the fear of workers back into the employer class.</p>\n\n<p>The UAW's stand-up strike strategy — targeted, rolling, unpredictable — was a master class in leverage. Rather than striking all facilities at once and exhausting strike funds rapidly, the union struck selectively, forcing management to guess where the next work stoppage would hit while keeping tens of thousands of workers in reserve.</p>\n\n<h2>More Than a Contract</h2>\n\n<p>The results were historic. The Big Three agreed to:</p>\n\n<ol>\n<li>Wage increases of approximately <span class=\"hl\">25 percent over four years</span></li>\n<li>Cost-of-living adjustments</li>\n<li>Faster progression to top pay</li>\n<li>The right to strike over plant closures</li>\n<li>Extension of union agreements to new electric vehicle battery plants</li>\n</ol>\n\n<p>But the UAW fight was about more than wages and benefits. It was a demonstration that the declines of American unionism — precipitous since the 1970s — are not inevitable laws of nature. They are political outcomes that can be reversed by sufficiently militant, strategically sophisticated organizing.</p>\n\n<blockquote class=\"ink-box\">Fain named the enemy directly: billionaire shareholders, corporate executives enriching themselves at worker expense, a political and economic system rigged against working people.<cite>— Labor Analysis, February 2024</cite></blockquote>\n\n<h2>The Organizing Moment</h2>\n\n<p>The UAW victory came at an inflection point. Worker militancy has been rising across sectors. Starbucks workers have unionized hundreds of locations. Amazon workers organized the first union at a company facility. Graduate student workers, nurses, journalists, and tech workers have all moved toward collective action in recent years.</p>\n\n<div class=\"callout\"><p>The question is whether this wave can become a structural shift — whether American labor can rebuild the density and power it lost during the long assault of the Reagan era and its aftermath.</p></div>\n\n<p>The conditions are more favorable than they have been in decades. Tight labor markets, rising inequality, the failures of financialized capitalism laid bare by the pandemic, and a new generation of workers radicalized by precarity and debt — all of these create openings that the labor movement, at its most ambitious, could exploit.</p>",
    "authorSlug": "marcus-okafor",
    "topic": "usa",
    "date": "2024-02-28",
    "featured": false,
    "image": "/images/articles/uaw-strike.jpg",
    "imageAlt": "UAW workers on the picket line in Detroit",
    "readingTime": 7
  },

  {
    "slug": "trumpism-after-trump",
    "title": "Trumpism Without Trump: The Authoritarian Right's Long Game",
    "excerpt": "The Republican Party has been remade in the image of a single man. But the forces that produced Trumpism — racial grievance, economic dislocation, culture war — will outlast any individual candidacy.",
    "content": "<p class=\"lead\">The central mistake of liberal anti-Trump politics was to treat Trumpism as aberration rather than symptom. Four years of 'this is not who we are,' of appeals to American exceptionalism, of nostalgia for a bipartisan consensus that was always more myth than reality — and the underlying conditions that produced Trump remained entirely unaddressed.</p>\n\n<p>When Trump lost in 2020, there was a liberal sigh of relief that confused electoral defeat with the defeat of a political tendency. The tendency, rooted in decades of economic dislocation, cultural backlash, racial resentment, and institutional decay, was not defeated. It was, if anything, <span class=\"hl\">more organized.</span></p>\n\n<h2>The Infrastructure of Reaction</h2>\n\n<p>The contemporary American right has built formidable organizational infrastructure:</p>\n\n<ul>\n<li>A media ecosystem that reaches tens of millions daily</li>\n<li>A network of think tanks and policy shops that developed detailed blueprints for administrative transformation (most notoriously <strong>Project 2025</strong>)</li>\n<li>A legal movement that has reshaped the federal judiciary</li>\n<li>A grassroots base that has captured school boards, county commissions, and state legislatures across the country</li>\n</ul>\n\n<div class=\"callout\"><p>This infrastructure will persist regardless of who is the Republican presidential nominee. It will be available to whoever commands the loyalty of the Republican base — and the base has been thoroughly, probably irreversibly, Trumpified.</p></div>\n\n<h2>The Left Response</h2>\n\n<p>The inadequacy of liberal anti-fascism is a separate question from the adequacy of socialist strategy. A left response to authoritarian nationalism cannot be reducible to defending the liberal status quo — which produced Trumpism in the first place — or to a defensive crouch that abandons any transformative politics.</p>\n\n<blockquote>The failures of neoliberal governance are what opened the door to the right. That argument requires offering something — a vision of working-class solidarity, economic transformation, and genuine democracy — that liberalism cannot.<cite>— Political Analysis, February 2024</cite></blockquote>\n\n<p>The task is simultaneously to build maximum resistance to authoritarian consolidation while arguing, clearly and without apology, that those failures created the conditions we now face.</p>",
    "authorSlug": "sidoc-haytu",
    "topic": "politics",
    "date": "2024-02-14",
    "featured": false,
    "image": "/images/articles/trumpism.jpg",
    "imageAlt": "Political rally crowd at night",
    "readingTime": 10
  },
  {
  "slug": "pol-pot-cambodia-kissinger",
  "title": "Pol Pot, Cambodia, and Kissinger: The Dialectics of Imperial Arrogance and Bourgeois Reaction",
  "excerpt": "Henry Kissinger, the American statesman, and Pol Pot, the Khmer Rouge leader, are treated as separate tragedies by bourgeois historians. To the Marxist-Leninist, this separation is a deliberate obfuscation of the material chain of causality that links the boardrooms of Washington to the killing fields of Cambodia.",
  "content": "<p class=\"lead\">The history of Cambodia in the latter half of the twentieth century presents a tragic dialectic that the bourgeois historian prefers to fragment: the story of Henry Kissinger, the American statesman, and the story of Pol Pot, the Khmer Rouge leader, are treated as separate tragedies. The former is debated in the halls of Georgetown and Brookings as a \"complex legacy\" of realism and geopolitics. The latter is consigned to the category of \"madman\" or \"genocidal tyrant,\" an aberration of communist ideology run amok.</p>\n\n<p>To the Marxist-Leninist, this separation is not merely intellectually dishonest—it is a deliberate obfuscation of the material chain of causality that links the boardrooms of Washington to the killing fields of Cambodia. Henry Kissinger, the Harvard professor turned national security advisor, and Pol Pot, the French-educated revolutionary, are not unrelated phenomena. They are dialectical products of the same imperialist contradiction—the former representing the ruthless logic of American empire, the latter representing the monstrous offspring of the destruction that empire wrought.</p>\n\n<p>This essay will trace the historical arc of Cambodia's destruction, analyze the class character of both the American intervention and the Khmer Rouge reaction, and expose the criminal complicity that the bourgeois press continues to sanitize. The evidence is overwhelming: Kissinger's bombing campaign created the conditions for Pol Pot's rise. The United States, having destabilized Cambodia, then cynically supported the Khmer Rouge at the United Nations when it served anti-Vietnamese geopolitical purposes. This is not \"tragedy\" or \"complexity.\" This is imperialism in its most naked, criminal form.</p>\n\n<h2>Part One: The Historical Context – Cambodia Before the Storm</h2>\n\n<h3>1. The Fragile Neutrality</h3>\n\n<p>Before the Vietnam War consumed its neighbor, Cambodia existed in a state of precarious neutrality under Prince Norodom Sihanouk. A constitutional monarch who skillfully navigated between the great powers, Sihanouk maintained Cambodia's independence while accepting aid from both the United States and China. The country was poor, underdeveloped, and burdened by a legacy of French colonialism, but it was at peace.</p>\n\n<p>The Vietnamese conflict, however, could not be contained. The Ho Chi Minh Trail, the logistical lifeline for the National Liberation Front in South Vietnam, ran through eastern Cambodia. North Vietnamese troops established base areas along the border, violating Cambodian neutrality with Sihanouk's tacit consent—he was powerless to stop them and unwilling to provoke Hanoi.</p>\n\n<h3>2. The Secret Bombing Begins</h3>\n\n<p>Enter Henry Kissinger. In 1969, as National Security Advisor to President Richard Nixon, Kissinger orchestrated the secret bombing of Cambodia—Operation Menu—targeting North Vietnamese sanctuaries along the border. The bombings were concealed from the American public, from Congress, and even from much of the military chain of command. False reporting systems were established; dual sets of books were kept.</p>\n\n<p>The initial justification was military necessity: North Vietnamese troops were using Cambodian territory to launch attacks on American forces. But the bombing did not remain confined to the border areas. Over the next four years, the United States dropped over 2.5 million tons of ordnance on Cambodia—more than the total tonnage dropped by Allied forces in the entire European theater of World War II. Recent estimates suggest the bombing killed approximately 150,000 Cambodian civilians.</p>\n\n<p>The human cost is not merely a statistic. For Cambodians who survived, the bombing was an apocalypse from the sky. Villages were obliterated. Families were incinerated. The countryside was cratered, its agricultural land rendered unusable, its irrigation systems destroyed. The survivors fled toward the cities or into the arms of whatever force promised protection from the American B-52s.</p>\n\n<h2>Part Two: The Bombing and Its Consequences – Creating the Conditions for Genocide</h2>\n\n<h3>1. The Destruction of Rural Society</h3>\n\n<p>The strategic logic of the bombing was self-defeating. By destroying the rural infrastructure and killing tens of thousands of peasants, the United States did not weaken the North Vietnamese—who were dug into deep bunkers and tunnels—but rather radicalized the Cambodian population. Peasants who had been indifferent or even hostile to the Khmer Rouge now saw the guerrillas as their only defenders against the American onslaught.</p>\n\n<p>Historian Ben Kiernan, one of the foremost scholars of the Cambodian genocide, has documented that Khmer Rouge recruitment surged in areas subjected to heavy bombing. The propaganda was simple and effective: \"The Americans are killing your families. Only we can stop them.\" The Khmer Rouge, a marginal force of perhaps 4,000 fighters in 1969, grew to over 50,000 by 1973.</p>\n\n<h3>2. The Overthrow of Sihanouk</h3>\n\n<p>In 1970, while Nixon and Kissinger were expanding the war, General Lon Nol overthrew Sihanouk in a US-backed coup. Sihanouk, from exile in Beijing, formed an unlikely alliance with the Khmer Rouge, lending his legitimacy to their cause. Cambodian peasants, who revered Sihanouk as a semi-divine figure, now had ideological cover to support the communist insurgency.</p>\n\n<p>The Nixon administration, having destabilized the region, then doubled down. In April 1970, American and South Vietnamese forces launched a ground invasion of Cambodia, pursuing the phantom of North Vietnamese headquarters that never existed. The invasion drove the North Vietnamese deeper into Cambodia, expanded the war, and further devastated the countryside.</p>\n\n<h3>3. The Power Vacuum</h3>\n\n<p>By 1973, when Congress finally forced an end to the bombing, Cambodia was in ruins. The economy had collapsed. Hundreds of thousands of refugees crowded into Phnom Penh. The Lon Nol government, corrupt and incompetent, controlled little beyond the capital. The Khmer Rouge, strengthened by American bombs and popular rage, tightened its grip on the countryside.</p>\n\n<p>The stage was set for the tragedy to come. As one Brookings analysis notes, the bombings \"contributed to the rise in support for the Khmer Rouge in Cambodia, which later ruled over a genocide of approximately 2 million people from 1975-79\". This is not correlation but causation, established by decades of historical scholarship.</p>\n\n<h2>Part Three: Pol Pot and the Khmer Rouge – The Monstrous Reaction</h2>\n\n<h3>1. The Ideology of Year Zero</h3>\n\n<p>Pol Pot, born Saloth Sar in 1925, was a product of French colonial education and Parisian communist circles. He studied in Paris on a scholarship, where he was exposed to Marxist theory filtered through the lens of French intellectual fashion. He returned to Cambodia in 1953 and joined the underground communist movement, eventually emerging as the leader of the Khmer Rouge.</p>\n\n<p>But Pol Pot's communism was not Marxism-Leninism. It was a bizarre, ultra-radical distortion that combined peasant romanticism with murderous paranoia. His goal was to create an agrarian utopia, purified of all foreign and modern influences, by forcibly returning the entire population to the land.</p>\n\n<p>When the Khmer Rouge captured Phnom Penh in April 1975, they immediately set about implementing this vision. The entire population of the capital—two million people—was driven into the countryside in a forced march that killed thousands. Money was abolished. Religion was suppressed. Schools and hospitals were closed. Families were separated. The country was renamed Democratic Kampuchea, and the calendar was reset to \"Year Zero\".</p>\n\n<h3>2. The Machinery of Death</h3>\n\n<p>What followed was one of the great horrors of the twentieth century. Between 1975 and 1979, the Khmer Rouge regime killed an estimated 1.5 to 2 million Cambodians—approximately one-quarter of the country's population.</p>\n\n<p>The killing took many forms:</p>\n\n<ul>\n<li>Direct execution in special centers like Tuol Sleng (S-21), where at least 17,000 men, women, and children were tortured and murdered.</li>\n<li>Starvation and disease resulting from forced labor on collective farms, where peasants worked eighteen-hour days on minimal rations.</li>\n<li>Targeted elimination of \"intellectuals\" —anyone who wore glasses, spoke a foreign language, or had any education was marked for death.</li>\n<li>Ethnic cleansing of Vietnamese and Cham Muslim minorities, who were systematically murdered.</li>\n</ul>\n\n<p>The regime's paranoia was boundless. It saw enemies everywhere—in the Party, in the army, in every village. Purges followed purges. Even loyal Khmer Rouge cadres were arrested, tortured, and killed as the revolution devoured its own children.</p>\n\n<h3>3. The Class Character of the Khmer Rouge</h3>\n\n<p>From a Marxist perspective, the Khmer Rouge was not a proletarian movement but a petty-bourgeois radical formation that had captured the state through a combination of guerrilla warfare and popular desperation. Its social base was the poorest peasantry, alienated from the cities and the educated classes. Its leadership was drawn from the French-educated elite—men like Pol Pot, Ieng Sary, and Khieu Samphan, who had studied in Paris and absorbed a distorted version of Marxist theory filtered through the lens of French intellectual fashion.</p>\n\n<p>The regime's economic program—the abolition of money, the destruction of cities, the forced collectivization of agriculture—was not socialism but primitive agrarian reaction. It represented the revenge of the countryside against the city, of the peasant against the intellectual, of pre-capitalist resentment against modernity. This is why the Khmer Rouge targeted not only the bourgeoisie but also skilled workers, engineers, and anyone associated with modern technology. Their vision was not a classless society but a society without classes because it had abolished civilization itself.</p>\n\n<h2>Part Four: The American Response – Cynicism Masked as Realism</h2>\n\n<h3>1. Kissinger's Silence</h3>\n\n<p>Throughout his long life, Henry Kissinger never apologized for Cambodia. When confronted with the consequences of his actions—the 150,000 civilians killed by American bombs, the destabilization that led to genocide, the unexploded ordnance that continues to kill Cambodian farmers today—he dismissed the criticism as the whining of those who did not understand the brutal necessities of statecraft.</p>\n\n<p>A 1970 transcript captures Kissinger's mentality: relaying Nixon's order for expanded bombing, he told General Alexander Haig to hit \"anything that flies, on anything that moves\". This is not the language of a thoughtful statesman weighing moral choices. This is the language of a man who had reduced entire nations to targets.</p>\n\n<p>When asked about Cambodia in later years, Kissinger offered defenses that ranged from the legalistic (the bombing was justified because North Vietnam had violated Cambodian neutrality) to the pragmatic (the alternatives were worse). He never acknowledged that the bombing itself had created the conditions for the Khmer Rouge's success.</p>\n\n<h3>2. The Cynical Embrace of Pol Pot</h3>\n\n<p>The full measure of American hypocrisy was revealed after the Khmer Rouge fell from power. In December 1978, Vietnam—itself a communist state but one aligned with the Soviet Union—invaded Cambodia and overthrew the Khmer Rouge regime. The Vietnamese installed a government led by former Khmer Rouge defectors, the People's Republic of Kampuchea.</p>\n\n<p>The United States faced a choice: align with Vietnam, the aggressor but also the force that had ended the genocide, or support the ousted Khmer Rouge as a counterweight to Vietnamese expansion. The choice was made swiftly and cynically. Washington threw its support behind the Khmer Rouge at the United Nations, recognizing the genocidal regime as Cambodia's legitimate government for years after it had been driven from power.</p>\n\n<div class=\"callout\"><p>Declassified diplomatic cables from 1978, released by WikiLeaks, paint a damning picture. A State Department cable from October 11, 1978, states: \"We believe a national Cambodia must exist even though we believe the Pol Pot regime is the world's worst violator of human rights. We cannot support [the] Pol Pot government, but an independent Kampuchea must exist\".</p></div>\n\n<p>The logic was transparent: the United States opposed Vietnamese influence in Southeast Asia more than it opposed genocide. Better to have Pol Pot, the butcher of two million, than to accept a Vietnam-aligned government in Phnom Penh.</p>\n\n<p>Another cable from July 20, 1978, explicitly instructs US diplomats not to support a credentials challenge against the Khmer Rouge at the UN, despite acknowledging the regime's horrific record. The United States actively protected Pol Pot's diplomatic status even as evidence of his crimes accumulated.</p>\n\n<h3>3. The Chinese Dimension</h3>\n\n<p>The cables also reveal the role of China, which armed and financed the Khmer Rouge throughout its reign and after its ouster. Chinese officials dismissed reports of mass killings as \"untrue\" and framed their support for Cambodia in terms of opposition to Vietnamese expansionism and its Soviet backers.</p>\n\n<p>For both Washington and Beijing, the Cold War calculus trumped all other considerations. The victims of the killing fields were collateral damage in a great power game.</p>\n\n<h2>Part Five: The Human Cost – Testimonies from the Abyss</h2>\n\n<h3>1. The Survivors' Stories</h3>\n\n<p>For Cambodians who lived through the horror, Kissinger is not a subject of academic debate. He is the man who destroyed their country. In Lowell, Massachusetts, home to the second-largest Cambodian American community in the United States, the response to Kissinger's death in 2023 was raw and personal.</p>\n\n<p>Sovanna Pouv, a community leader, described the reaction on social media: \"People are posting that he's evil or that they're surprised he lived to 100 [considering] the acts he was involved with\".</p>\n\n<p>Vesna Nuon, a city councilor in Lowell, recalled his father discussing Kissinger in the early 1970s: \"My father would talk about how bitter he was and how Kissinger and the others who planned [the bombing] got away with it for a long time\".</p>\n\n<p>State Representative Vanna Howard shared a family history of loss: her uncle was killed in the US bombing of Cambodia. Her father, both maternal grandparents, and her three younger siblings were killed in the civil war that followed. \"Only my mom and I survived,\" she said. \"It's unfortunate [Kissinger] was never brought to justice\".</p>\n\n<h3>2. The Continuing Legacy of UXO</h3>\n\n<p>The bombs did not stop killing when the war ended. Cambodia remains one of the most heavily contaminated countries in the world by unexploded ordnance (UXO). Since 1979, American UXOs have contributed to over 64,000 casualties and 25,000 amputees. Farmers still lose limbs plowing their fields. Children still die playing with objects they mistake for toys.</p>\n\n<p>The United States has provided some funding for UXO removal—$208 million between 1993 and 2023. But this is a fraction of the cost of the bombs themselves, and it does nothing to restore the lives lost or the generations traumatized. When the Trump administration briefly suspended UXO removal funding in 2025 as part of a broader foreign aid pause, China announced $4.4 million to continue the work. The imperialist power that dropped the bombs now expects credit for cleaning up a fraction of the mess, while its geopolitical rival steps in when the cleanup stops.</p>\n\n<h3>3. The Khmer Rouge Tribunal</h3>\n\n<p>Decades after the genocide, an international tribunal convicted a handful of Khmer Rouge leaders. Nuon Chea, \"Brother Number 2,\" and Khieu Samphan, the head of state, were sentenced to life in prison for crimes against humanity and genocide. Kaing Guek Eav, the commandant of Tuol Sleng prison, was also convicted.</p>\n\n<p>Pol Pot never faced justice. He died under house arrest in 1998, having been denounced by his former comrades in a show trial the year before. His final interview included the chilling statement: \"My conscience is clear\".</p>\n\n<p>No American official has ever faced accountability for the bombing campaign that created the conditions for the genocide. Kissinger died at 100, feted by the foreign policy establishment, mourned by the Brookings Institution as a \"remarkable man\". The Rolling Stone headline put it more accurately: \"Henry Kissinger, War Criminal Beloved by America's Ruling Class, Finally Dies\".</p>\n\n<h2>Part Six: Analysis – The Dialectics of Imperialism and Reaction</h2>\n\n<h3>1. The Logic of Imperial Destruction</h3>\n\n<p>From a Marxist-Leninist perspective, the Cambodian tragedy is not an aberration but an expression of the inherent logic of imperialism. The United States, fighting to maintain its domination over Southeast Asia, did not hesitate to destroy a neutral country to achieve its aims. Cambodia was not the target; it was simply in the way.</p>\n\n<p>Kissinger's \"realism\" was the ideology of this destruction. It reduced foreign policy to a calculus of power, stripped of moral content, in which the lives of Cambodian peasants were simply not factors to be weighed. The 150,000 killed by bombing were \"collateral damage.\" The two million killed by the Khmer Rouge were \"tragic\" but not America's responsibility, despite the clear causal chain linking the bombs to the genocide.</p>\n\n<p>This is the essence of imperialist thinking: the lives of non-Western peoples are quantities to be managed, not ends in themselves. They can be sacrificed for geopolitical objectives, and their suffering, when inconvenient, can be ignored.</p>\n\n<blockquote class=\"ink-box\">The Khmer Rouge, for all its revolutionary rhetoric, represented not the working class but the lumpen-peasantry and the déclassé intelligentsia. Its social base was the poorest peasants, alienated from the cities and the modern world. Its leadership was drawn from the French-educated elite, men who had absorbed revolutionary theory without revolutionary practice and transformed it into murderous fantasy.<cite>— Sidoc Haytu</cite></blockquote>\n\n<h3>2. The Class Character of the Khmer Rouge</h3>\n\n<p>Lenin understood this danger. He wrote of the \"petty-bourgeois revolutionaries\" who, lacking a scientific understanding of Marxism, would substitute adventurism for analysis, terror for organization, and destruction for construction. The Khmer Rouge was the ultimate expression of this tendency—a movement that, in attempting to leap directly to communism, produced only death.</p>\n\n<h3>3. The American Embrace of Pol Pot</h3>\n\n<p>The United States' post-1979 support for the Khmer Rouge at the United Nations reveals the hollowness of American human rights rhetoric. The Carter administration, which had made human rights a centerpiece of its foreign policy, nevertheless ensured that Pol Pot's regime retained Cambodia's UN seat. The reason was geopolitical: Vietnam was a Soviet ally, and any government in Phnom Penh aligned with Hanoi was unacceptable.</p>\n\n<p>This was not hypocrisy but consistency at a deeper level. The United States does not support human rights; it supports governments that serve its interests. When a genocidal regime serves those interests—by opposing Vietnamese expansion, by fighting a proxy war against the Soviet Union—it becomes an ally. When it falls from power, it continues to receive diplomatic protection.</p>\n\n<p>The cables from 1978 make this explicit. US officials acknowledged the Khmer Rouge as \"the world's worst violator of human rights\" while simultaneously working to preserve its diplomatic standing. The cognitive dissonance was not resolved; it was simply accepted as the price of Cold War competition.</p>\n\n<h2>Part Seven: Conclusion – The Unfinished Reckoning</h2>\n\n<p>The story of Cambodia under Pol Pot is often told as a cautionary tale about communist extremism. It is that. But it is also a story about American imperialism, about the arrogance of power, and about the refusal of the powerful to acknowledge their crimes.</p>\n\n<p>Henry Kissinger died at 100, celebrated by the foreign policy establishment, mourned by the Brookings Institution as a \"remarkable man\". Cambodians who survived the killing fields watched his funeral from half a world away, knowing that justice would never come. The Rolling Stone headline captured the truth that polite society prefers to suppress: \"Henry Kissinger, War Criminal Beloved by America's Ruling Class, Finally Dies\".</p>\n\n<p>The Khmer Rouge leaders who survived were eventually tried and convicted, but only after decades of delay, and only for crimes committed after 1975. The bombing that created the conditions for their rise, the coup that destabilized the country, the diplomatic protection extended to the regime after its fall—none of this has been subjected to judicial scrutiny. No American official has ever been held accountable for Cambodia.</p>\n\n<p>The bombs continue to kill. The unexploded ordnance scattered across the Cambodian countryside still claims limbs and lives. The farmers who lost parents to the killing fields now lose children to the bombs that Kissinger ordered dropped half a century ago. The United States provides some funding for clearance, then suspends it, then restores it—treating the ongoing death of Cambodians as a bureaucratic matter to be managed.</p>\n\n<p>For the revolutionary, the lesson is clear. Imperialism does not apologize. It does not atone. It does not learn. It simply continues, destroying one country after another, generating the conditions for new horrors, and then mourning its own \"complex legacies\" while the victims rot in unmarked graves.</p>\n\n<p>The only response is uncompromising struggle—against the imperialist powers that drop the bombs, against the local reactionaries who rise from the rubble, and against the apologists who sanitize both. Cambodia's dead demand no less.</p>\n\n<p>Henry Kissinger was not a complex statesman. He was a war criminal who escaped justice.</p>\n\n<p>Pol Pot was not a madman. He was the monstrous offspring of imperial destruction.</p>\n\n<p>The United States is not a force for good in the world. It is the world's leading exporter of death, destabilization, and despair.</p>\n\n<p>Down with American imperialism!<br />\nJustice for the victims of Cambodia!<br />\nNever forget the killing fields—and never forget who fertilized them with bombs.</p>\n\n<p>— Sidoc Haytu</p>",
  "authorSlug": "sidoc-haytu",
  "topic": "international",
  "date": "2026-02-21",
  "featured": false,
  "image": "/images/articles/cambodia-killing-fields.jpg",
  "imageAlt": "Cambodian killing fields memorial with skulls",
  "readingTime": 28
},
  {
  "slug": "venezuela-argentina-myths-reality",
  "title": "Socialism Didn't Fail in Venezuela",
  "excerpt": "When critics blame socialism for Venezuela's collapse and praise Milei's shock therapy in Argentina, they ignore centuries of imperial meddling, resource curses, and the human cost of libertarian austerity. A materialist examination of what's really happening in Latin America.",
  "content": "<p class=\"lead\">The comments section of any video discussing socialism reveals a predictable trilogy of objections: social democracies like Sweden are the preferable alternative, Venezuela was destroyed by socialist policies, and Javier Milei is courageously saving Argentina from leftist ruin. The first argument I addressed elsewhere. The latter two demand a more rigorous historical and materialist examination.</p>\n\n<p>Before proceeding, we must establish what socialism actually means in this context. Socialism, properly understood, is worker control and democratic management of the means of production. Markets, where they exist, remain subordinate to human well-being. The profit motive yields to the principle that no one goes hungry or houseless while excess is destroyed or homes sit vacant. Socialism manifests differently across traditions—from Leninists to anarchists—but the common thread is the democratization of economic power.</p>\n\n<p>My own conception favors decentralization: worker cooperatives, councils, and dual power structures that minimize state bureaucracy while maximizing working-class control over capital. This matters because when we examine Venezuela, we must distinguish between centralized state capitalism and genuine worker control.</p>\n\n<h2>The Venezuelan Tragedy: A Century in the Making</h2>\n\n<p>The standard narrative presents Venezuela as a cautionary tale of socialist excess. This requires erasing over a century of history that precedes Chavismo entirely.</p>\n\n<h3>American Empire and the Making of a Petrostate</h3>\n\n<p>In 1908, the United States Navy facilitated a coup that installed Juan Vicente Gómez, a dictator described by a later Venezuelan president as \"an instrument of foreign control of the Venezuelan economy.\" Gómez protected American oil interests and brutalized his people with Washington's blessing. This pattern repeated with Marcos Pérez Jiménez in the 1950s—another US-backed tyrant who welcomed transnational corporations while suppressing Venezuelans.</p>\n\n<p>The result was an economy structured entirely around oil extraction for foreign benefit. Venezuela became a classic petrostate: rich in a single resource, utterly dependent on its extraction, and managed by elites who prioritized American interests over national development. The resource curse—also called Dutch disease—took hold. When a country possesses abundant natural resources, it often fails to diversify its economy. Why develop other sectors when oil money flows so freely? Venezuela used petroleum revenue to import everything it needed, indefinitely postponing the development of domestic industry.</p>\n\n<p>This context is essential. When Hugo Chávez won election in 1998, he inherited a country already deformed by a century of imperial extraction and elite enrichment.</p>\n\n<h3>The Bolivarian Revolution: Successes and Failures</h3>\n\n<p>Chávez launched the Bolivarian Revolution, implementing social reforms that objectively improved living standards. Poverty and illiteracy declined. Healthcare expanded. The state nationalized oil industries—a move that, whatever its flaws, attempted to redirect Venezuela's wealth toward Venezuelans rather than foreign shareholders. Chávez even supplied free heating oil to hundreds of thousands of poor Americans in winter, a gesture of solidarity that Washington repaid with hostility.</p>\n\n<p>The United States responded with predictable aggression: coup attempts, economic sanctions, and diplomatic demonization. The Obama administration bizarrely declared Venezuela a national security threat—a nation that has never invaded anyone, backed death squads, or drone-struck weddings, unlike the country making the declaration.</p>\n\n<p>But Chávez also made catastrophic economic errors. He devalued the bolívar, fueling inflation. He neglected oil infrastructure maintenance. He failed to learn the industry on which his country depended. Most critically, he treated high oil prices as permanent rather than cyclical, spending boom revenues without saving for the inevitable bust. He never diversified Venezuela's exports or developed other economic sectors. When oil prices plummeted after his 2013 death, the country had no buffer.</p>\n\n<h3>Maduro, Sanctions, and the Simplification of Blame</h3>\n\n<p>Nicolás Maduro inherited an impossible situation: a petrostate with collapsing oil revenues, a leader who refused to maintain the industry, and a US sanctions regime deliberately designed to strangle the economy. His response—printing money to maintain social programs—produced hyperinflation. His corruption is real and indefensible. The image of him sneaking food on live television while his people starve captures something genuinely damning.</p>\n\n<p>But blaming \"socialism\" for Venezuela's collapse requires ignoring everything that preceded it. It requires forgetting that Venezuela experienced devastating crises in the 1980s and 1990s under <em>right-wing</em> governments. When oil prices crashed in the 1980s, Venezuela found itself $33 billion in debt and accepted an IMF loan. The IMF's conditionality meant privatization, deregulation, social program cuts, and economic opening to foreign investment—the standard neoliberal medicine. These policies produced inequality, rioting, looting, and political turmoil that <em>created</em> the conditions for Chávez's popularity.</p>\n\n<p>It also requires ignoring Bolivia, where Evo Morales's incremental socialist policies raised living standards dramatically. Under Morales, extreme poverty fell by more than half. GDP grew average 4.8% annually from 2004 to 2017. The World Bank reclassified Bolivia from lower-income to lower-middle-income status. Socialism didn't destroy Bolivia because Bolivia, unlike Venezuela, diversified its economy and managed its resources prudently.</p>\n\n<div class=\"callout\"><p>Venezuela's tragedy is not the tragedy of socialism. It is the tragedy of a petrostate deformed by imperialism, mismanaged by corrupt elites of all ideological stripes, and finally strangled by sanctions while a cartoonishly incompetent successor stumbled through a crisis he was never equipped to handle.</p></div>\n\n<h2>Argentina's Libertarian Experiment: Shock Therapy and Human Suffering</h2>\n\n<p>If Venezuela represents the Right's favored cautionary tale, Javier Milei's Argentina represents its aspirational model—a libertarian president bravely wielding the chainsaw against the state. The reality is considerably darker.</p>\n\n<h3>The Logic of Shock Therapy</h3>\n\n<p>Javier Milei, a right-wing libertarian of ostentatious principle, campaigned on cutting government spending, mass privatization, deregulation, and the full libertarian program. This approach has a name in economic literature: shock therapy. The strategy works best when implemented immediately after a natural disaster, war, or economic crisis—moments of public disorientation when populations are too distracted to resist unpopular measures. As Naomi Klein documented extensively, shock therapy exploits crisis to push through policies that would otherwise face massive opposition. And when people resist, they face \"shock for a third time by police, soldiers, and prison interrogators.\"</p>\n\n<p>Milei inherited an Argentina already in crisis—the necessary precondition for shock therapy. Within months, he delivered.</p>\n\n<h3>The Human Cost of Austerity</h3>\n\n<p>Milei devalued the currency by over 50%, immediately impoverishing anyone holding pesos. His austerity program increased poverty from 42% to 53% in six months—the highest level since 2003. Child poverty approached 70%. Energy subsidy cuts produced a 360% increase in subway fares. Price control elimination meant essential goods and rent became unaffordable. One supermarket worker in Buenos Aires reported his rent had soared 90% after real estate deregulation and his electricity bill had nearly tripled after subsidy cuts. \"They say things are getting better,\" he told the Associated Press, \"but how? I don't understand.\"</p>\n\n<p>To his credit, Milei cooled month-over-month inflation and achieved a budget surplus—the first in years. But this came through the largest public spending cut in three decades, achieved by pauperizing the population. A taxi driver put it plainly: \"The world that the government lives in with all these numbers saying the economy is great—it's a fantasy. In the real world, this economy makes it really hard to feed my son.\"</p>\n\n<p>This is the difference between economic indicators and human welfare. A budget surplus achieved by making 53% of the population poor enough to stop consuming is not an achievement; it is a confession.</p>\n\n<h3>The Peso, the Dollar, and Monetary Sovereignty</h3>\n\n<p>Milei's currency devaluation reflects his stated goal: abandoning the peso entirely for the US dollar. Surrendering monetary sovereignty means Argentina would lose the ability to respond to its own economic conditions with its own policy tools. It would hand control of its money supply to the Federal Reserve, which answers to American, not Argentine, interests. This is not libertarianism; it is colonial economics rebranded.</p>\n\n<p>The protests came immediately. The repression followed. A member of Milei's coalition offered protesters \"prison or a bullet.\" Very principled. Very libertarian.</p>\n\n<h2>The Materialist Analysis: What Actually Explains These Cases?</h2>\n\n<p>Blaming Venezuela on socialism and praising Milei's Argentina requires ignoring almost everything that actually determines economic outcomes.</p>\n\n<h3>Imperialism and the Resource Curse</h3>\n\n<p>Venezuela's fate was sealed long before Chávez by a century of US intervention that structured its economy around extraction for foreign benefit. The resource curse—the failure to diversify that afflicts petrostates globally—is not a socialist phenomenon. Saudi Arabia is not socialist. The Gulf monarchies are not socialist. They suffer the same dependency because resource wealth, regardless of political system, creates perverse incentives to avoid diversification. Venezuela's tragedy is the tragedy of the petrostate, intensified by sanctions and corruption.</p>\n\n<h3>Shock Therapy's Class Character</h3>\n\n<p>Milei's policies are not neutral technical adjustments; they are class warfare. Devaluation transfers wealth from workers who hold pesos to exporters and foreign investors. Subsidy cuts transfer resources from the poor who need public services to the rich who benefit from reduced taxation. Deregulation transfers power from labor to capital. The surplus Milei boasts about is extracted from the bodies of Argentine workers. When 70% of children live in poverty, a budget surplus is not an achievement; it is an atrocity.</p>\n\n<h3>The Convenience of the Socialist Boogeyman</h3>\n\n<p>Socialism functions as a useful rhetorical target because it allows commentators to avoid complexity. If Venezuela's collapse proves socialism's failure, we need not examine US sanctions, IMF conditionalities, or the structural deformities of petrostates. If Milei's austerity is necessary medicine, we need not examine who suffers and who benefits. The socialist boogeyman simplifies a complicated world into moral fable.</p>\n\n<p>But material reality resists such simplification. Venezuela's crisis has many fathers: American empire, elite corruption, oil dependency, economic mismanagement, and yes, Maduro's incompetence. Argentina's \"recovery\" has many victims: the 53% now poor, the 70% of children now hungry, the workers whose rents tripled while their wages devalued.</p>\n\n<h2>Conclusion: Beyond the Boogeyman</h2>\n\n<p>The lesson is not that socialism always succeeds or capitalism always fails. The lesson is that ideological labels obscure more than they reveal when divorced from material analysis. Venezuela under Chávez was never pure socialism; it was state capitalism with social programs, dependent on oil revenues, mismanaged by leaders who never democratized economic power. Argentina under Milei is not principled libertarianism; it is shock therapy that pauperizes millions to achieve fiscal targets.</p>\n\n<p>The real question is not whether socialism works or fails. The real question is who controls economic resources, who benefits from economic policy, and whether human well-being or capital accumulation serves as the organizing principle of society. By that measure, Venezuela's tragedy is that ordinary people never truly controlled the oil wealth extracted from their land. Argentina's tragedy is that ordinary people are paying for fiscal discipline with their children's hunger.</p>\n\n<p>The convenient myths of socialist failure and libertarian success serve the same function: they prevent us from asking harder questions about power, about empire, about who decides and who pays. Until we ask those questions, we will continue mistaking symptoms for causes and boogeymen for explanations.</p>",
  "authorSlug": "sidoc-haytu",
  "topic": "socialism",
  "date": "2026-02-22",
  "featured": false,
  "image": "/images/articles/latin-america-protest.jpg",
  "imageAlt": "Protesters in Latin America with banners",
  "readingTime": 12
},
  {
  "slug": "9th-wpk-congress-analysis",
  "title": "The 9th Congress of the Workers' Party of Korea: Fortress of Anti-Revisionist Struggle and the Irreversible Path of Juche",
  "excerpt": "While Western media obsesses over pariah narratives, the 9th Congress of the Workers' Party of Korea has reaffirmed the DPRK's commitment to revolutionary self-reliance, nuclear sovereignty, and the complete rejection of capitalist integration. An analysis from the anti-imperialist front.",
  "content": "<p class=\"lead\">PYONGYANG — In a thunderous demonstration of the unbrea,kable unity between the Leader, the Party, and the Masses, the 9th Congress of the Workers' Party of Korea (WPK) has successfully convened, marking a historic milestone in the protracted struggle for the final victory of socialism.</p>\n\n<p>Guided by the immortal banners of Kimilsungism-Kimjongunism, the Congress opened on February 19 at the April 25 House of Culture. This supreme assembly serves as a powerful rebuff to the desperate maneuvers of international imperialism, proving that the Democratic People's Republic of Korea remains an impregnable fortress of anti-revisionist fervor and revolutionary self-reliance.</p>\n\n<h2>The Vanguard Reaffirms Its Leadership</h2>\n\n<p>With the absolute trust of the entire working class, the Congress unanimously re-elected Comrade Kim Jong Un as General Secretary of the WPK. This re-election is not merely a procedural act but a sacred vow by the Korean people to follow the path of Juche under the seasoned guidance of the Great Successor.</p>\n\n<p>In his comprehensive report on the work of the Central Committee, Comrade Kim Jong Un analyzed the brilliant victories achieved since the 8th Congress. Despite the \"vicious and persistent\" economic blockades imposed by global capital, the DPRK has successfully transitioned into a \"new stage of national development,\" prioritizing the material and cultural well-being of the proletariat over the interests of global markets.</p>\n\n<h2>Forging a Revolutionary Path</h2>\n\n<p>The Congress outlined strategic directives to fortify the socialist state:</p>\n\n<ul>\n<li><strong>Generational Fortification:</strong> A sweeping reorganization of the Central Committee has integrated a new generation of revolutionaries, ensuring the purity of the Party's bloodline and preventing the ideological rot of reformism.</li>\n<li><strong>The Arsenal of the Proletariat:</strong> Reaffirming the \"irreversible\" nuclear status of the Republic, the Congress emphasized that the expansion of the nuclear deterrent is the only guarantee of peace against the nuclear-blackmail policy of the U.S. imperialists.</li>\n<li><strong>Sovereign Economy:</strong> Rejecting the \"globalist\" trap, the 9th Congress solidified a five-year plan centered on domestic production and the modernization of heavy industry, ensuring the DPRK remains immune to the crises inherent in the decaying capitalist system.</li>\n</ul>\n\n<div class=\"callout\"><p>The decision to deepen nuclear capacity while simultaneously expanding heavy industry represents a strategic line that confounds Western analysts conditioned to believe that sanctions must produce capitulation. The DPRK does not capitulate; it adapts, innovates, and advances.</p></div>\n\n<h2>The International Significance</h2>\n\n<p>For the global anti-imperialist movement, the 9th Congress carries lessons that extend far beyond the Korean Peninsula. In an era when nominally socialist governments increasingly accommodate themselves to global capital—accepting IMF conditionalities, opening strategic industries to foreign investment, and abandoning the language of class struggle—the WPK stands as a reminder that an alternative exists.</p>\n\n<p>The DPRK's path is not presented as a universal model. Every revolution must develop according to its specific historical and material conditions. But the <em>principle</em> of the DPRK's path—that a small country can resist imperialist domination, that nuclear sovereignty is available to any nation determined enough to pursue it, that economic development need not mean cultural submission to the West—has profound implications for the Global South.</p>\n\n<p>When Vietnamese comrades study the Korean experience, when Cuban delegates exchange protocols with their Korean counterparts, when African liberation movements examine how the DPRK survived the collapse of the Soviet bloc without succumbing to capitalist restoration—they are engaging with a living tradition of anti-imperialist struggle that refuses to treat capitalist integration as inevitable.</p>\n\n<h2>The Question of Revisionism</h2>\n\n<p>The 9th Congress's emphasis on \"preventing ideological rot\" and rejecting \"reformism\" reflects a longstanding tension within the international communist movement. The DPRK watched as the Soviet Union degenerated into revisionism, as China embraced market mechanisms that reintroduced capitalist relations, as Eastern European parties collapsed before the counterrevolution of 1989-91.</p>\n\n<p>From the DPRK's perspective, these were not merely policy disagreements but fundamental betrayals of revolutionary principle. The restoration of commodity relations, the integration into global capitalist markets, the abandonment of vanguard party leadership—all prepared the ground for counterrevolution. The WPK's insistence on maintaining strict ideological discipline, on subordinating economic policy to political objectives, on treating nuclear sovereignty as non-negotiable, reflects a determination to avoid that fate.</p>\n\n<p>Critics on the left who dismiss this as \"Stalinist\" or \"authoritarian\" miss the material basis of Korean strategy. When your country has been partitioned by imperialist powers, when your people endured colonial brutality, when your cities were flattened by American bombs that killed 20% of the population, when your revolution survives in the shadow of 28,000 US troops stationed just south of the DMZ—the stakes of ideological compromise become visible in a way that comfortable Western leftists may struggle to comprehend.</p>\n\n<h2>Juche and Self-Reliance in Practice</h2>\n\n<p>The Congress's economic directives—centered on domestic production and heavy industry modernization—continue the Juche tradition of maximizing self-reliance. This is not autarky as an abstract ideal but autarky as survival strategy. The DPRK cannot depend on international markets that the US dominates, cannot trust supply chains that Washington can sever, cannot accept loans that come with political conditionalities.</p>\n\n<p>The five-year plan announced at the Congress prioritizes:</p>\n\n<ul>\n<li>Completion of the Regional Development 20×10 Policy, bringing modern industry to every county</li>\n<li>Expansion of the metallurgical and chemical industries to reduce import dependence</li>\n<li>Modernization of the rail network to improve internal logistics</li>\n<li>Agricultural mechanization to achieve full food sovereignty</li>\n<li>Continuation of the rural housing construction program</li>\n</ul>\n\n<p>Each of these priorities reflects the same strategic logic: build internal capacity so that external pressure cannot force capitulation. When the DPRK produces its own fertilizer, it cannot be starved by fertilizer sanctions. When it generates its own electricity, it cannot be blackmailed by energy blockades. When it produces its own weapons, it cannot be bombed with impunity.</p>\n\n<blockquote class=\"ink-box\">The Western left, too often distracted by liberal critiques of Korean \"human rights\" or \"democracy deficits,\" fails to recognize that the DPRK has achieved something extraordinary: a small country, subjected to the most comprehensive sanctions regime in human history, has not only survived but continues to develop, to build, to advance. It has done so by refusing the fundamental premise of capitalist globalization—that all nations must integrate into the world market on terms set by imperialist powers.<cite>— Sidoc Haytu</cite></blockquote>\n\n<h2>The Nuclear Question Revisited</h2>\n\n<p>Western commentary on the 9th Congress will predictably focus on the nuclear deterrence reaffirmation, treating it as provocation or threat. This framing inverts reality. The DPRK developed nuclear weapons because it witnessed what happened to countries that did not: Iraq, invaded on pretexts and destroyed. Libya, which surrendered its nuclear program in exchange for Western promises, then bombed and destabilized. Ukraine, which gave up Soviet-era nukes for security guarantees that proved worthless.</p>\n\n<p>The US maintains nuclear arsenals sufficient to destroy the planet multiple times. It deploys them around the world, including in South Korea, aimed at the DPRK. It conducts joint military exercises simulating invasion. It refuses to sign a peace treaty formally ending the Korean War. And then it expresses concern when the DPRK develops the capacity to defend itself.</p>\n\n<p>The Congress's language—\"irreversible\" nuclear status—signals that the DPRK has moved beyond the denuclearization-for-aid negotiations that characterized earlier periods. The strategic calculation is clear: negotiations produced temporary relief but no fundamental security guarantee. The US proved unwilling to normalize relations, unwilling to lift sanctions, unwilling to end the military threat. Under these conditions, nuclear weapons are not a bargaining chip but the foundation of survival.</p>\n\n<h2>Onward to Final Victory</h2>\n\n<p>The 9th Congress has sent a clear message to the world: the Korean revolution will not be stifled. By upholding the principle of self-reliance, the WPK has shown that a nation committed to Marxist-Leninist principles can forge its own destiny without bowing to the dictates of foreign capital.</p>\n\n<p>As the delegates return to their posts, the spirit of the Congress will ignite a new labor upsurge across the factories and fields of the Republic. The path is set, the leadership is solidified, and the victory of the socialist cause is inevitable.</p>\n\n<p>For the international left, the task is not uncritical endorsement of every WPK policy but serious engagement with the Korean experience. What can be learned about surviving imperialist pressure? About maintaining revolutionary continuity across generations? About building economic capacity under blockade? About preserving ideological clarity when the global atmosphere is saturated with capitalist propaganda?</p>\n\n<p>The DPRK's answers to these questions may not be universally applicable. But they deserve study rather than dismissal—especially from Western leftists who have never faced the material pressures that Koreans confront daily.</p>\n\n<p>The 9th Congress reaffirms that the contradiction between imperialism and the anti-imperialist front remains unresolved, that the struggle continues, and that on the Korean Peninsula, at least, the forces of revolution have not surrendered.</p>\n\n<p>Long live the Workers' Party of Korea!<br />\nLong live the Great Comrade Kim Jong Un!<br />\nDown with US imperialism!<br />\nVictory to the anti-imperialist struggle!</p>",
  "authorSlug": "sidoc-haytu",
  "topic": "international",
  "date": "2026-02-23",
  "featured": false,
  "isLive": false,
  "image": "/images/articles/pyongyang-congress.jpg",
  "imageAlt": "Mass gathering in Pyongyang with banners and flags",
  "readingTime": 9
},
{
  "slug": "us-israel-launch-massive-strikes-iran-retaliates",
  "title": "US and Israel Launch Massive Strikes on Iran; Tehran Retaliates Across Region",
  "excerpt": "The United States and Israel carried out coordinated military strikes against Iran early Saturday, hitting targets in Tehran and several provinces. Iran has launched retaliatory missile attacks against American bases in Bahrain, Qatar, and the UAE, raising fears of a widening regional war.",
  "content": "<p class=\"lead\">BEIRUT — The United States and Israel launched a series of coordinated airstrikes against Iran early Saturday morning, targeting military facilities, government buildings, and infrastructure in and around Tehran, according to Iranian state media and U.S. officials.</p>\n\n<p>President Donald Trump confirmed the operation in a televised address, calling it a \"massive and ongoing\" campaign to \"degrade Iran's ability to threaten regional stability.\" The strikes mark a dramatic escalation in the decades-long conflict between Washington, its regional ally Israel, and the Islamic Republic.</p>\n\n<h2>Scope of the Attack</h2>\n\n<p>Israeli Defense Minister Israel Katz announced the operation as a \"preemptive strike\" against Iran, declaring a special state of emergency across Israel. U.S. officials, speaking on condition of anonymity, confirmed that American forces participated in the strikes, which involved aircraft, drones, and missiles launched from multiple platforms in the region.</p>\n\n<p>Targets included:</p>\n\n<ul>\n<li>The compound of Supreme Leader Ayatollah Ali Khamenei in Tehran, according to satellite imagery reviewed by multiple news organizations</li>\n<li>Iran's Ministry of Intelligence and Ministry of Defense buildings</li>\n<li>The Iranian Atomic Energy Agency facility</li>\n<li>The Parchin military complex, long suspected of housing weapons development programs</li>\n<li>Multiple Islamic Revolutionary Guard Corps installations across the country</li>\n</ul>\n\n<p>Iranian state media reported that air defense systems intercepted several incoming missiles, but acknowledged \"some damage\" to targeted sites. Casualty figures remain unclear, though the semi-official Fars news agency reported at least 24 people killed, including IRGC personnel. An all-girls school in Minab County was struck, killing at least 57 students, according to local officials.</p>\n\n<h2>Iran Retaliates</h2>\n\n<p>Within hours of the initial strikes, Iran launched retaliatory missile attacks against American assets across the Middle East. The Islamic Revolutionary Guard Corps claimed responsibility for what it called \"Operation Truthful Promise 4,\" saying it targeted U.S. military installations in several countries.</p>\n\n<p>Confirmed impacts include:</p>\n\n<ul>\n<li>The U.S. Navy's Fifth Fleet headquarters in Manama, Bahrain, where satellite imagery shows damage to multiple buildings</li>\n<li>Al-Udeid Air Base in Qatar, the largest U.S. military facility in the region, where an American radar and air defense system was destroyed, according to Qatari officials</li>\n<li>Multiple explosions in Dubai and Abu Dhabi, with all flights suspended from both international airports</li>\n<li>Missile strikes in Kuwait and Saudi Arabia, though authorities there reported intercepting most incoming projectiles</li>\n</ul>\n\n<p>In a separate development, Iran's Revolutionary Guards announced they had struck the USS Abraham Lincoln carrier strike group in the Arabian Sea. The Pentagon declined to comment on the claim, which could not be independently verified.</p>\n\n<h2>Israel Under Fire</h2>\n\n<p>Iran also launched multiple waves of ballistic missiles toward Israel throughout Saturday. The Israeli military reported sirens sounding across the country, with impacts reported in Tel Aviv, Haifa, and the Galilee region. The military said its air defense systems intercepted most incoming missiles but acknowledged \"several hits\" that caused damage and injuries. Ambulance services reported at least 12 people wounded by shrapnel.</p>\n\n<h2>Diplomatic Context</h2>\n\n<p>The military escalation comes just days after U.S. and Iranian negotiators concluded a second round of indirect talks in Geneva, mediated by Oman. Iranian Foreign Minister Abbas Araghchi had described the talks as \"progressing\" and said both sides had reached preliminary agreements on several issues.</p>\n\n<p>Omani Foreign Minister Badr al-Busaidi, who mediated the talks, had met with U.S. Vice President JD Vance on Friday and posted on social media: \"Peace is within our reach.\" Hours later, American and Israeli forces struck Tehran.</p>\n\n<p>Analysts say the timing suggests the negotiations were never intended to succeed. \"The talks were a smokescreen,\" said Tang Zhichao, director of the Center for Middle East Development and Governance Studies at the Chinese Academy of Social Sciences. \"This was a carefully planned result.\"</p>\n\n<h2>Strait of Hormuz Threatened</h2>\n\n<p>In a related development, Iran's Revolutionary Guards issued a warning that \"passage through the Strait of Hormuz is not allowed\" until further notice, according to a statement carried by Sepah News, the IRGC's official news outlet. The strait is a critical chokepoint through which approximately 20% of global oil passes.</p>\n\n<p>The warning raised fears of supply disruptions that could send oil prices soaring. Global benchmark Brent crude jumped 8% in early trading before stabilizing.</p>\n\n<h2>Regional Reactions</h2>\n\n<p>Regional governments responded with alarm to the escalating conflict. Saudi Arabia called for restraint and urged all parties to avoid further escalation. The United Arab Emirates condemned attacks on its territory while also calling for a ceasefire.</p>\n\n<p>Russia warned that the \"new aggression is fraught with the danger of significant deterioration and destabilization.\" China expressed concern and called on all parties to exercise restraint. The European Union issued a statement urging \"maximum restraint\" from all sides.</p>\n\n<p>France, Germany, and the United Kingdom issued a joint statement expressing \"grave concern\" and calling for an immediate de-escalation.</p>\n\n<h2>U.S. Domestic Response</h2>\n\n<p>In Washington, the strikes drew mixed reactions. Republican leaders largely supported the action, with Senate Majority Leader John Thune saying the president \"acted decisively to protect American interests.\"</p>\n\n<p>Democratic Senator Tim Kaine called the strikes \"dangerous, unnecessary, and idiotic,\" demanding the Senate return to session to vote on a War Powers Resolution. House Minority Leader Hakeem Jeffries said the administration \"must immediately brief Congress on the scope and objectives of this military action.\"</p>\n\n<p>The White House said President Trump would address the nation again on Saturday evening.</p>\n\n<h2>What Comes Next</h2>\n\n<p>Military analysts say the conflict could escalate further, particularly if Iran follows through on threats to close the Strait of Hormuz or if Hezbollah and other Iran-aligned groups enter the fighting.</p>\n\n<p>The Pentagon has approximately 40,000 troops and 13 major bases across the Middle East, all potentially vulnerable to Iranian retaliation. U.S. officials said additional forces were being moved to the region but declined to provide details.</p>\n\n<p>Iran's mission to the United Nations issued a statement warning that \"any further aggression will be met with immediate and decisive retaliation\" and that \"the United States and Israel bear full responsibility for the consequences of their reckless adventure.\"</p>",
  "authorSlug": "sidoc-haytu",
  "topic": "news",
  "date": "2026-02-28",
  "featured": true,
  "isLive": true,
  "image": "/images/articles/iran-striked.jpg",
  "imageAlt": "Smoke rising over Tehran after US-Israeli strikes",
  "readingTime": 5
}
]
